docs/emacs/javascript-fontification.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Thoughts on JavaScript Fontification in Emacs</title>
<!-- 2017-07-20 Thu 05:28 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="John Hooks" />
<meta name="viewport" content="width=device-width, initial-scale=1"><link rel="stylesheet" type="text/css" href="/thoughts/style.css" /></head>
<body>
<div id="preamble" class="status">
<div id="nav"><a href="/thoughts/">Home</a></div>
</div>
<div id="content">
<h1 class="title">Thoughts on JavaScript Fontification in Emacs</h1>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Syntax Analysis</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><code>syntax-propertize-extend-region-functions</code></h3>
<div class="outline-text-3" id="text-1-1">
<p>
Abnormal hook to extend the start and end of region before calling
`syntax-propertize-function'.  The only token that extends beyond a
newline is a template string.  So I will have to flush the lex cache
and see if it landed on a template, if so go back to the beginning and
flush the cache to the beginning of the line on which the template
started and then repeat the check.  When searching to end, will need
to track <code>`</code> pairs and watchout for 
<code>`something ${ `weird like ${ this}` }`</code>
</p>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">JavaScript Template Strings</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Because template strings may span multiple line they could interfere
with proper syntax analysis and fontification if not handled properly.
</p>
</div>

<div id="outline-container-sec-1-2-1" class="outline-4">
<h4 id="sec-1-2-1">Concept</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
Break up the lexing of template strings on newlines. This would mean
there could be multiple template string elements between the opening
and closing delimiters, of either the backquote and/or dollar brace
pairs. 
</p>

<ul class="org-ul">
<li>Use the generic string syntax class between the break points.
</li>
<li>Use the paired delimiter class for the <code>`</code>.
</li>
<li>Caution: Could this cause odd highlighting at the beginning of a
line? Because the first character would be the generic string
delimiter, it could cause new characters added to the beginning
of the line to not be highlighted correctly for a short period
of time.
</li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Considerations</h2>
<div class="outline-text-2" id="text-2">
<p>
If the tokenization of <code>jove-TEMPLATE</code> and <code>jove-JSX-TEXT</code> end on
newlines, it should be much easier to create a
<code>syntax-propertize-extend-region-function</code> which does not require an
analysis of the buffer in order to find START and STOP points. It can
just flush the parser cache to a saved position and the STOP point can
end on any line.
</p>

<p>
I do not know how often syntax-propertize caches. It could be difficult
to insure the two line up.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: John Hooks</p>
<p class="date">Date: <span class="timestamp-wrapper"><span class="timestamp">&lt;2017-07-19 Wed&gt;</span></span></p>
<p class="creator">Generated by: <a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.2.2 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
</div>
</body>
</html>
